import typer as tp

cli_hubs = tp.Typer(
    name="hubs",
    no_args_is_help=True,
    add_completion=False,
)


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Serve HUBS Rest API",
)
def rest_serve(
    host: str = tp.Option(
        "0.0.0.0",  # Default value
        "--host",
        "-h",
        help="Host to serve the API",
    ),
    port: int = tp.Option(
        55221,  # Default value
        "--port",
        "-p",
        help="Port to serve the API",
    ),
):
    import eyegway.hubs.rest.api as erha
    import uvicorn

    api = erha.HubsRestAPI()
    uvicorn.run(api, host=host, port=port)


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="List HUBs",
)
def list():
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHubManager.create()

    rich.print(hub.list())


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Info about an HUB",
)
def info(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    )
):
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHub.create(name=hub_name)

    rich.print(f"Hub |[red]{hub_name}[/red]| info:")
    rich.print("- Buffer size:", hub.buffer_size())
    rich.print("- History size:", hub.history_size())


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Clear HUB",
)
def clear(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    )
):
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHub.create(name=hub_name)
    hub.clear()
    rich.print(f"Hub |[red]{hub_name}[/red]| cleared!")


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Clear HUB History",
)
def clear_history(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    )
):
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHub.create(name=hub_name)
    hub.clear_history()
    rich.print(f"Hub |[red]{hub_name}[/red]| history cleared!")


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Clear HUB Buffer",
)
def clear_buffer(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    )
):
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHub.create(name=hub_name)
    hub.clear_buffer()
    rich.print(f"Hub |[red]{hub_name}[/red]| buffer cleared!")


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Pop HUB data to file",
)
def pop(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    ),
    filename: str = tp.Option(
        ...,
        "--filename",
        "-f",
        help="File to save the data",
    ),
):
    import eyegway.hubs.sync as ehs
    import rich

    hub = ehs.MessageHub.create(name=hub_name)
    data = hub.pop(timeout=1)
    if data is None:
        rich.print(f"Hub |[red]{hub_name}[/red]| buffer is empty!")
        return

    with open(filename, "wb") as f:
        f.write(hub.packer.pack(data))

    rich.print(f"Hub |[red]{hub_name}[/red]| data popped to |[red]{filename}[/red]!")


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Print HUB history data",
)
def last(
    hub_name: str = tp.Option(
        ...,
        "--name",
        "-n",
        help="Hub name",
    ),
    offset: int = tp.Option(
        0,
        "--offset",
        "-o",
        help="History offset",
    ),
):
    import eyegway.hubs.sync as ehs
    import eyegway.packers as ep
    import rich

    hub = ehs.MessageHub.create(name=hub_name)
    data = hub.last(offset=offset)
    if data is None:
        rich.print(f"Hub |[red]{hub_name}[/red]| history[{offset}] is empty!")
        return
    ep.MessagePacker.pretty_print(data)


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_hubs.command(
    short_help="Info about packed data",
)
def pack_info(
    filename: str = tp.Option(
        ...,
        "--filename",
        "-f",
        help="Packed File",
    ),
):
    import eyegway.packers.factory as epf
    import eyegway.packers as ep

    data = open(filename, "rb").read()
    unpacked = epf.PackersFactory.default().unpack(data)
    ep.MessagePacker.pretty_print(unpacked)
