import typer as tp

cli_packer = tp.Typer(
    name="packer",
    no_args_is_help=True,
    add_completion=False,
)


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
# ░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄░▄▄▄
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░


@cli_packer.command(
    short_help="Packed data info",
)
def info(
    filename: str = tp.Option(
        ...,
        "--input-filename",
        "-i",
        help="Packed file to load",
    )
):
    import eyegway.packers.factory as epf
    import eyegway.packers as ep

    data = open(filename, "rb").read()
    unpacked = epf.PackersFactory.default().unpack(data)
    ep.MessagePacker.pretty_print(unpacked)
